cyclorotor/cycloid/backGround/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh   dynamicOversetFvMesh;

dynamicOversetFvMeshCoeffs
{
//    layerRelax 0.3;
}

//motionSolverLibs ( "libfvMotionSolvers.so" );
//
//solver          displacementLaplacian;
//
//displacementLaplacianCoeffs
//{
//    diffusivity     uniform 1;
//}

solver          multiSolidBodyMotionSolver;

multiSolidBodyMotionSolverCoeffs
{
    movingZone1
    {
        solidBodyMotionFunction tabulated6DoFMotion;
        CofG         (0 0.07 0);
        timeDataFileName "$FOAM_CASE/constant/6DoF1.dat";
    }
    
    movingZone2
    {
        solidBodyMotionFunction tabulated6DoFMotion;
        CofG         (0 -0.07 0);
        timeDataFileName "$FOAM_CASE/constant/6DoF2.dat";
    }
    
    movingZone3
    {
        solidBodyMotionFunction tabulated6DoFMotion;
        CofG         (-0.07 0 0);
        timeDataFileName "$FOAM_CASE/constant/6DoF3.dat";
    }
    
    movingZone4
    {
        solidBodyMotionFunction tabulated6DoFMotion;
        CofG         (0.07 0 0);
        timeDataFileName "$FOAM_CASE/constant/6DoF4.dat";
    }
}

// ************************************************************************* //
