cyclorotor/cycloid/backGround/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-0.25 -0.25 -0.025)
    ( 0.25 -0.25 -0.025)
    ( 0.25  0.25 -0.025)
    (-0.25  0.25 -0.025)
    (-0.25 -0.25  0.025)
    ( 0.25 -0.25  0.025)
    ( 0.25  0.25  0.025)
    (-0.25  0.25  0.025)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (100 100 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(   

    overset
    {
        type overset;
        faces ();
    }

    topAndBottom
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
        );
    }

    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }

    front
    {
        type empty;
        faces
        (
            (4 5 6 7)
        );
    }

    back
    {
        type empty;
        faces
        (
            (0 3 2 1)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
